In [21]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [22]:
ser1 = Series([1,2,3,4],index = ['A','B','C','D'])

ser1

A    1
B    2
C    3
D    4
dtype: int64

In [23]:
#Reindexing by including new indices, Pandas automatically fills the values w/NaN
ser2 = ser1.reindex(['A','B','C','D','E','F'])

ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [24]:
#Any new indices added will fill with 0 instead of NaN
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [25]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])

ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [26]:
ranger = range(15)

In [27]:
#Range just makes a range of (x) points 0 to x-1
ranger

range(0, 15)

In [28]:
#Forward fill grab previous value and forward fill it until it hits something with a value
#0-4 USA, 5-9 Mexico 10-14 Canada 
ser3.reindex(ranger,method='ffill')
#bfill would make 10-14 null and the other canada and mexico

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [29]:
#Building a DataFrame, call 25 random numbers, make them a 5 by 5 with reshape
# use a letter index, and set columns
dframe = DataFrame(randn(25).reshape((5,5)), index=['A','B','D','E','F'], 
                   columns=['col1','col2','col3','col4','col5'])

dframe

       col1      col2      col3      col4      col5
A  0.287960 -1.732437  0.126780  2.211095  1.512461
B  0.102974 -0.364964  1.624958 -0.098502  0.432964
D -0.663818  0.545729 -0.906970 -1.095879  0.334480
E  0.167857 -1.730421  0.133699 -0.952502  0.986453
F -1.000127  0.196953 -1.355572 -1.454246 -1.426299

In [30]:
#Forgot C, how do you reindex?
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [31]:
#Note: Null values are Placed in the new index!
dframe2

       col1      col2      col3      col4      col5
A  0.287960 -1.732437  0.126780  2.211095  1.512461
B  0.102974 -0.364964  1.624958 -0.098502  0.432964
C       NaN       NaN       NaN       NaN       NaN
D -0.663818  0.545729 -0.906970 -1.095879  0.334480
E  0.167857 -1.730421  0.133699 -0.952502  0.986453
F -1.000127  0.196953 -1.355572 -1.454246 -1.426299

In [32]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [33]:
#Must call columns in reindex to reindex columns, notice new column values NaN
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A  0.287960 -1.732437  0.126780  2.211095  1.512461   NaN
B  0.102974 -0.364964  1.624958 -0.098502  0.432964   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.663818  0.545729 -0.906970 -1.095879  0.334480   NaN
E  0.167857 -1.730421  0.133699 -0.952502  0.986453   NaN
F -1.000127  0.196953 -1.355572 -1.454246 -1.426299   NaN

In [34]:
dframe

       col1      col2      col3      col4      col5
A  0.287960 -1.732437  0.126780  2.211095  1.512461
B  0.102974 -0.364964  1.624958 -0.098502  0.432964
D -0.663818  0.545729 -0.906970 -1.095879  0.334480
E  0.167857 -1.730421  0.133699 -0.952502  0.986453
F -1.000127  0.196953 -1.355572 -1.454246 -1.426299

In [39]:
#Note can no longer use ix to quickly reindex, deprecated! Use reindex
dframe.reindex(['A','B','C','D','E','F'],columns=new_columns)

       col1      col2      col3      col4      col5  col6
A  0.287960 -1.732437  0.126780  2.211095  1.512461   NaN
B  0.102974 -0.364964  1.624958 -0.098502  0.432964   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.663818  0.545729 -0.906970 -1.095879  0.334480   NaN
E  0.167857 -1.730421  0.133699 -0.952502  0.986453   NaN
F -1.000127  0.196953 -1.355572 -1.454246 -1.426299   NaN